In [1]:
import pandas as pd
from pandas import DataFrame,Series
import numpy as np

In [4]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),
                   index=pd.Index(['LA','SF'],name='City'),
                   columns=pd.Index(['A','B','C','D'],name='letter'))

In [5]:
dframe1

letter  A  B  C  D
City
LA      0  1  2  3
SF      4  5  6  7

In [18]:
dframe3 = DataFrame(np.arange(8).reshape(2,4),
                   index=pd.Index(['jhapa','Morang'],name='district'),
                   columns=pd.Index(['A','B','C','D'],name='Postion'))
dframe3

Postion   A  B  C  D
district
jhapa     0  1  2  3
Morang    4  5  6  7

In [6]:
dframe_st = dframe1.stack()

In [7]:
dframe_st

City  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [8]:
dframe_st.unstack()

letter  A  B  C  D
City
LA      0  1  2  3
SF      4  5  6  7

In [20]:
dframe_st.unstack('letter')

letter  A  B  C  D
City
LA      0  1  2  3
SF      4  5  6  7

In [21]:
dframe_st.unstack('City')

City    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [23]:
ser1 = Series([0,1,2],index=['Q','X','Y'])
ser2 = Series([4,5,6],index=['X','Y','Z'])

In [24]:
dframe = pd.concat([ser1,ser2],keys=['Alpha','Bita'])
dframe

Alpha  Q    0
       X    1
       Y    2
Bita   X    4
       Y    5
       Z    6
dtype: int64

In [25]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Bita   NaN  4.0  5.0  6.0

In [26]:
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Bita   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [27]:
dframe = dframe.unstack()

In [28]:
dframe

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Bita   NaN  4.0  5.0  6.0

In [29]:
dframe.stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Bita   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [30]:
dframe.stack(dropna=False)

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Bita   Q    NaN
       X    4.0
       Y    5.0
       Z    6.0
dtype: float64